[
    {
        "ID": "",
        "Instance": "",
        "case_details": "[12:45] Virtual Agent: Welcome to Speedcast.\n[12:45] Virtual Agent: Could you please type in the following information below:\n[12:45] Virtual Agent: First and Last Name?\n[12:45] Guest: John Doe\n[12:45] Virtual Agent: Who can I connect you to today?\n[12:46] Guest: Support\n[12:46] Virtual Agent: Is there an existing case number for reference?\n[12:46] Guest: Yes\n[12:46] Virtual Agent: Can you please type in the Case Number (eg. CS0000001)\n[12:46] Guest: 3047865\n[12:46] Virtual Agent: Just a moment, I will transfer you to a live agent.\n[12:46] System: Amy Chen has entered the chat.\n[12:46] Amy Chen: Thanks for reaching out to our support team. Just a moment, we will advise you shortly.\n[12:47] Guest: Thank you Amy\n[12:47] Amy Chen: Hi How may I assist you?\n[12:47] Guest: Hi Amy, we would like an update\n[12:47] Amy Chen: Yes, sure. Give me a moment and I will retrieve the ticket\n[12:48] Guest: Great\n[12:49] Amy Chen: It appears that the commit is today. It was escalated to the 1st level\n[12:49] Guest: Did it go missed yesterday?\n[12:49] Amy Chen: Yes, it did. Then, there is a new commit today\n[12:50] Guest: Great\n[12:50] Guest: Thanks a lot\n[12:50] Guest: Can you please ensure that it gets completed by the end of the day?\n[12:50] Amy Chen: Yes, I can. Is there anything else I can assist you with?\n[12:51] Guest: Nope\n[12:51] Guest: Thanks a lot for your help\n[12:51] Amy Chen: Have a nice day!\n[12:52] Guest: You too\n[12:56] System: The conversation is timing out, are you still there?\n[12:58] Virtual Agent: It seems you have left the conversation",
        "targets_pretokenized": " Request for issue update and completion assurance.</s>",
        "chat_category": ""
    },
    {
        "ID": "",
        "Instance": "",
        "case_details": "[11:57] Virtual Agent: \n\n[11:57] Virtual Agent: What is the case number you are inquiring about? ( if none, please type in N/A)\n[12:35] Julia Jones: n/a\n[12:35] Virtual Agent: How can I help you today? ( include details like product, KB etc)\n[12:35] Julia Jones: issue with placing order\n[12:35] Virtual Agent: Can you please choose the contact type of the case?\n[12:36] Julia Jones: Telephone\n[12:36] Virtual Agent: You may type in your request below, or please use the button to see everything that I may be able to help with.\n[12:36] Virtual Agent: Show me everything\n[12:36] Julia Jones: Live Agent Support\n[12:36] Virtual Agent: I will connect you to a live agent, please wait.\n[12:36] System: George Warren has entered the chat.\n[12:36] George Warren: Thank you for reaching out to our support team. Let me look into your question and advise accordingly.\n[12:36] George Warren: Hello \n[12:36] Julia Jones: hi\n[12:37] Julia Jones: cx is having issues placing order\n[12:37] Julia Jones: she is saying that the visa card has a 0 balance\n[12:37] George Warren: How can I assist you with this?\n[12:38] George Warren: Can you please share the case number?\n[12:38] Julia Jones: CS7635567\n[12:38] Julia Jones: @L[/sn_customerservice_case.do?sys_id=47888ff61b84d5d0180beca2604dfg56|CS7635567]\n[12:39] George Warren: Sorry, but this case is empty. Could you please give me the proxy for this?\n[12:40] System: George Warren has closed the support session.\n[12:42] Virtual Agent: Thank you for using our support chat",
        "targets_pretokenized": " Customer needs help with order placement due to visa card issue.</s>",
        "chat_category": ""
    },
    {
        "ID": "",
        "Instance": "",
        "case_details": "[05:11] Virtual Agent: Welcome to Cisco.\n[05:11] Virtual Agent: Will you be able to provide the below details:\n[05:11] Virtual Agent: What is your First and Last Name?\n[05:11] Guest: Pulkit Sharma\n[05:11] Virtual Agent: You would like to connect to?\n[05:11] Guest: Support\n[05:11] Virtual Agent: Will you be able to provide a case number for reference?\n[05:11] Guest: Nope\n[05:11] Virtual Agent: I will now connect you to a live agent. Please wait while I do so.\n[05:11] System: Arun Kumar has joined the chat.\n[05:11] Arun Kumar: Thank you for reaching out to us. I will be right back.\n[05:15] Arun Kumar: Hello, Good morning to you. My name is Arun, how can I assist you? Please enter your account number or business name along with the address?\n[05:15] Guest: Latham & Watkins LLP\n[05:15] Guest: acct#123321\n[05:15] Guest: 10250 Constellation Blvd., Suite 1100. Los Angeles, CA 90067\n[05:16] Arun Kumar: How may I assist you?\n[05:16] Guest: one of our attorneys all calls are being directed to another person which shoudl be happening\n[05:17] Guest: I have no clue what is happening since the numbers and extensions are valid on the admin page\n[05:17] Arun Kumar: Please provide me the line numbers\n[05:17] Arun Kumar: Also please provide your phone and name/email\n[05:18] Guest: the ext is 8998 and the numbers is 123-222-3232\n[05:18] Guest: these are being directed to the ext 2322\n[05:19] Guest: my name is Pulkit and my email is plkit@ciscnwisk.com\n[05:19] Guest: 444-343-2323 is my contact number\n[05:20] Arun Kumar: CS0092323 IS YOUR CASE NUMBER\n[05:20] Arun Kumar: you would be contacted by our team soon. May I assist you with anything else?\n[05:20] Guest: No thank you that would be all for today\n[05:21] Arun Kumar: We appreciate you reaching out to us. Have a nice day.\n[05:21] System: Arun Kumar has left the conversation\n[05:21] System: Arun Kumar has ended the session\n[05:21] System: The chat has ended\n[05:21] System: The chat transcript can be downloaded\n[05:21] Virtual Agent: @L[https:cisco-download-script.com\n[05:21] Virtual Agent: Thank you for using Cisco live agent chat",
        "targets_pretokenized": " \"User reports attorney call forwarding issue.\"</s>",
        "chat_category": ""
    },
    {
        "ID": "",
        "Instance": "",
        "case_details": "[12:37] Virtual Agent Bot: Thank you for contacting Visa's Chat Support. How may I assist you today?\n[12:37] Virtual Agent Bot: You can type your request below, or use the button to see everything that I can help with.\n[12:37] Virtual Agent Bot: See all topics\n[12:38] John Doe : I've got a case started about a fraudulent gift card.\n[12:38] Virtual Agent Bot: I want to be sure I got this correct. What object below best describes what you want to do?\n[12:40] John Doe : I want something else\n[12:40] Virtual Agent Bot: No problem, let's try again. Type your request below or select one that matches what you want to do.\n[12:40] Virtual Agent Bot: You can type your request below, or use the button to see everything that I can help with.\n[12:40] Virtual Agent Bot: See all topics\n[12:41] John Doe : the last response I received said they cant find a card ending in the number given. But the reason the card is fraudulent is because we can see where number have been scratched off\n[12:41] Virtual Agent Bot: I am sorry but I didn't understand your request.\n[12:41] Virtual Agent Bot: Please try entering your request in a different way. I'm currently better at understanding short sentences.\n[12:41] Virtual Agent Bot: You can type your request below, or use the button to see everything that I can help with.\n[12:41] Virtual Agent Bot: See all topics\n[12:41] John Doe : Check on Case Status\n[12:41] Virtual Agent Bot: How would you like to find the case you are interested in?\n[12:42] John Doe : Search by case number\n[12:42] Virtual Agent Bot: Please enter the case number\n[12:42] John Doe : CS3980088\n[12:42] Virtual Agent Bot: Please pick the case you want to check:\n[12:42] John Doe : CS3980088: Fraud - Real American Superstore\n[12:42] Virtual Agent Bot: Here’s the case you selected: \n[12:42] Virtual Agent Bot: @L[URL]\n[12:42] Virtual Agent Bot: Here are some additional actions you can take:\n[12:42] John Doe : Contact an agent\n[12:42] Virtual Agent Bot: I'm now transferring you to an agent to help you with case CS3980088\n[12:42] Virtual Agent Bot: Please stand by while I connect you to a live agent.\n[12:43] System: Agent has entered the chat.\n[12:43] Agent: Thank you for contacting support.  I am looking into your issue and will be able to assist you shortly.\n[12:44] Agent: Hello, thank you for contacting Visa Chat Support. How may I assist with CS3980088?\n[12:44] Agent: @L[URL]\n[12:44] John Doe : the reason they cant find that card number is because the data on the card have been scraped off\n[12:45] John Doe : there are data missing\n[12:45] John Doe : that is why we know it is a fraudulent card\n[12:45] John Doe : I really want to deactivate the card \n[12:46] John Doe : so we can give the user a refund\n[12:48] Agent: Please hold while I gather this information, I will be back in 1-2 minutes.\n[12:50] System: The conversation is timing out, are you still there?\n[12:50] John Doe : yes I am\n[12:51] Agent: Thank you for holding. I am unable to locate the card in question as the pictures are not clear. Could you please provide me with the last 4 digits of the card that are shown on the receipt?\n[12:52] John Doe : 6617\n[12:53] Agent: Thank you for that information. Please give me 1 to 2 min to locate your card.\n[12:53] John Doe : okay\n[12:54] John Doe : @L[URL]\n[12:56] Agent: Thank you for holding. I am not able to locate the card in question. Could you please confirm the below information that was originally provided? \n\n*Store name and number\nReal American Superstore #2822\n*Date and time of the transaction\n2019-11-24 21:21:19\n*Card Partner\nAritzia\n*Last for digits of cards from the recipe\n6617\n[12:57] John Doe : the date purchased was January 21 2019\n[12:58] John Doe : at 14:01\n[12:59] Agent: Thank you. Please give me 1 to 2 min to locate the card.\n[13:02] System: The conversation is timing out, are you still there?\n[13:02] John Doe : okay\n[13:03] Agent: Thank you for holding. I was able to locate the card in question. The full card number is 6051000794000456617 and was activated for $775.\n\nWith the card in hand, are the card numbers missing or was it damaged when it was scrapped to reveal the card number?\n[13:04] John Doe : the card numbers are missing here\n[13:05] John Doe : should I just give the customer the card and give her all the numbers back?\n[13:06] John Doe : if I look very closely at the card I can see the little scratch marks where the missing data should me\n[13:10] Agent: We could assist in one of the ways. You are able to provide the customer with the full card data or I am able to escalate the case to our level two team for refund consideration.  Please note that Visa and our partners attempt to block and devalue on any cards that have full balance; if redemption has occurred, we will not be able to complete the request as transaction settlements have initiated.\n[13:10] System: The conversation is timing out, are you still there?\n[13:10] John Doe : okay\n[13:11] Agent: If the card numbers are fully missing from a printing error data, we would need to escalate the case to our level two team as the card would be classified as a switch card.\n[13:11] John Doe : it looks like the card had been tampered with before it was sold to the customer\n[13:12] John Doe : how long will it take to escalate? the customer has been waiting  a few days and is getting angry\n[13:13] Agent: Could you please provide me with the customer's contact information?\n[13:14] John Doe : Jane Doe 1-305-313-3000 janedoe@example.com\n[13:14] Agent: With escalating the case, our level two team reaches back out within 1 to 2 business days.\n[13:15] Agent: The time frame would be the same as a normal refund as our level two agents have to reach out to the card partner.\n[13:16] John Doe : so the earliest we will get a response would be tuesday or wednesday\n[13:16] Agent: Sure\n[13:16] Agent: To confirm the email address we have on file for our level two team to reach out is Sre01831@koblow.ca. Is this correct?\n[13:17] John Doe : yes\n[13:17] Agent: Thank you for confirming. I have escalated the case to our level two team. Is there anything else I can assist with?\n[13:18] John Doe : no that's everything, thank you so much\n[13:18] Agent: Thank you for contacting Visa Chat Support. I hope you have a great day!\n[13:22] System: The conversation is timing out, are you still there?\n[13:26] Virtual Agent Bot: It seems you have left the chat",
        "targets_pretokenized": " \"Customer seeks Visa's help in fraudulent gift card case.\"</s>",
        "chat_category": ""
    },
    {
        "ID": "",
        "Instance": "",
        "case_details": "[05:58] Virtual Agent Bot: Welcome to Magna5.\n[05:58] Virtual Agent Bot: Can you please provide the following information:\n[05:58] Virtual Agent Bot: Your First Name and Last Name?\n[05:59] Guest: George Warren\n[05:59] Virtual Agent Bot: Would you like to connect to?\n[05:59] Guest: Support\n[05:59] Virtual Agent Bot: You would like to\n[05:59] Guest: Chat with Technical Support\n[05:59] Virtual Agent Bot: Do you hold a case number for reference?\n[05:59] Guest: I do\n[05:59] Virtual Agent Bot: Please enter the Case Number (eg. CS0000009)\n[05:59] Guest: CS0167213\n[05:59] Virtual Agent Bot: Please stand by while I connect you to a live agent.\n[05:59] System: Jane Doe has entered the chat.\n[05:59] Jane Doe: Thank you for contacting us. We will be with you shortly.\n[06:00] Jane Doe: Good morning. Welcome to Magna5 Support\nThis is Jane here\nPlease tell me how can we help you?\n[06:00] Guest: Hi, Jane!  I was just thinking if you could be able to give me an review on case CS0167213\n[06:01] Guest: I have not recevied something\n[06:03] Jane Doe: The team has created a new request case based on the CS016713 and ended it \nthe new request number is  - 724574\nthe case is attached to a technician and will be worked upon today\n[06:04] System: The chat is ending out, are you still there?\n[06:04] Guest: oh, that's good!  I am glad about your help\n[06:04] Jane Doe: Awesome!\nAnything else that we can help with?\n[06:04] Guest: I believe that's it for now.  Thanks again\n[06:05] Jane Doe: Thank you so much for reaching out to Magna5 Support. Have a great rest of your day.\n[06:08] System: The conversation is ending, are you still here?\n[06:08] Guest: you too\n[06:08] Jane Doe: Thank you ? \n[06:10] System: Jane Doe left the chat\n[06:10] System: Jane Doe has closed the support session.\n[06:10] System: The conversation has ended\n[06:10] System: You can download the transcript of this conversation\n[06:10] Virtual Agent Bot: @L[URL]\n[06:10] Virtual Agent Bot: Thank you for using Magna5 live agent chat",
        "targets_pretokenized": " Guest Requests Review of Case CS0167213</s>",
        "chat_category": ""
    }
]