[
    {
        "ID": "Case: PAX4852528",
        "case_details": "A case was opened with a short description of Invoice is not correct\nA longer description includes Hi,\n\nYour invoice is not correct.\nWe had previously been incorrectly charged for this, and we disputed the amount with Mastercard. If the invoice can't be fixed, we'll switch aggregators. Due to this, a billing issue has required an excessive amount of time and effort. We won't pay the extra $200 that was charged. We are pleased to pay the $25 requested for the proper usage that was submitted.\nI already contested this amount with Mastercard, but if you fix the invoice, I'd be pleased to take it off. I won't spend a lot of time or energy on this, so please fix it right away or you'll lose our business.\n\nRegards,\nEdward Thomas| Assistant Engineer\n[acengineering logo]\n\n881 Woodbury Dr\nPO Box 776\nPittsburgh , PA 16789\nOffice: 675-768-3678 x 401\nDirect:  675-768-3678\nCell: 675-789-6868\nedward.thomas@acengineering.com <maito:edward.thomas@acengineering.com>\nwww.acengineering.com<https:\/\/link0.servicenow.com>\n[cid: image001.jpg@78788234.783450]\n\nInformation that is privileged, confidential, or otherwise protected from disclosure to anyone other than its intended recipients may be included in this electronic mail message and its attachments. It is strictly forbidden for anyone other than the intended recipients to distribute or otherwise use this electronic email or any of its contents (including any attachments). If you believe you have got this email in error, please reply to it right away to let the sender know. Please delete the original message and any attached files. I appreciate your help.\nSophos enterprise will check this email for viruses and spam.\n\nState: Awaiting Info\nAn array of activities from activity stream with created date, its type such as a comment or work note and if it's added by agent or customer and the text: \n<|ACTIVITY_START|>Creation date: 2022-09-07 07:30:30 work_notes: I plan to check this tomorrow with Billing\n<|ACTIVITY_START|>Creation date: 2022-09-07 07:45:10 comments: Hi,\n       We appreciate you reaching out to Magna5 tech support. Please be patient while we investigate the request.\n       It will be great if you can provide more details or screenshots that can help speed up our investigation.\n       Best,\n       Philip\n<|ACTIVITY_START|>Creation date: 2022-09-07 07:46:28 work_notes: https:\/\/magna5\/subscriptions\/456467467\n<|ACTIVITY_START|>Creation date: 2022-09-07 08:08:23 comments: Hello all,   \n       This is David Parker from the Administration Orders and Billing\n       I'm getting in touch with our APAC's Cloud team and our vendor partner manager for Acronis to make sure someone can join our discussion about the misreported Acronis usage.\n       We'll do everything to see if there are any more possibilities that we can jointly pursue in this situation. Please be patient as I gather the required players in one spot.\n       Appreciate your patience, hope you have a great day\n<|ACTIVITY_START|>Creation date: 2022-09-17 07:47:40 work_notes: We are working on your request. Reached out to Nick Thomas and Richard Davidson for further investigation\nSLAs : \n\n<SLAS START>\nNo information available\n<SLAS END>",
        "inputs_pretokenized": "[]",
        "targets_pretokenized": "Issue:\nThe customer, Edward Thomas, has raised a concern about an incorrect invoice. He has been charged an extra $200 which he has disputed with Mastercard. He requests the invoice to be corrected, otherwise, he threatens to switch aggregators.\n\nKey Actions Taken:\n- The case was assigned for checking with the Billing department\n- The customer was asked to provide more details or screenshots to speed up the investigation\n- A link related to the customer's subscriptions was shared\n- David Parker from the Administration Orders and Billing got in touch with the APAC's Cloud team and the vendor partner manager for Acronis to discuss the misreported Acronis usage\n- Nick Thomas and Richard Davidson were contacted for further investigation\n\nResolution:\nNot enough case activity for AI to summarize yet"
    },
    {
        "ID": "Case: CS8772530",
        "case_details": "A case was opened with a short description of New Ticket - [#7853530] - Error code(Canada): Supplier Order # 953281228\/XOXO Order 12438779-1\n\n\nState: Closed\nAn array of activities from activity stream with created date, its type such as a comment or work note and if it's added by agent or customer and the text: \n<|ACTIVITY_START|>Creation date: 2023-08-19 15:11:45 work_notes: Original Email Subject:\nNew Ticket - [#7853530] - Error code(Canada): Supplier Order # 953281228\/XOXODAY Order 12438779-1\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:16:45 work_notes: Original Email Body:\nHi, Hola, Bonjour! We have received your request and a ticket has been created Su solicitud ha sido recibida y hemos creado un ticket para resolverla. Nous avons bien re u votre demande et un ticket a  t  cr  .  Sincerely, Customer Service Team ********************************************** Hello, Good day! Please check this order in your system, the person said that attempting to type the code gave an error. Please look and let me know. XOXO#12438779-1 Supplier Order # 953281228 Reward: Costco - CAD 25 Quantity: 1 Order Date: 2022-12-11  Thank you! Best Regards, Amarita\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:21:45 work_notes: Knowledge Article KB0130474 Added.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:26:45 work_notes: Reviewed order\nverified card in Hawk.\nGave card status.\nOffered refund.\n1st attempt.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:31:45 work_notes: Hello Amarita,\n\nAppreciate your patience as we pursued your request.\n\nThis communication is concerning CS2920967 for order 953281228.\n\nWe have checked the information provided and wanted to let you know that the card was activated.\n\nIf the card is causing trouble for the customer, we can try voiding the card and attempt a refund.\n\nPlease let us know how to continue.\n\nWe await your reply.\n\nRegards,\nFidda A.\nCustomer Service Specialist.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:36:45 work_notes: Reviewed order\nverified card in Hawk.\nGave card status.\nOffered refund.\n2nd attempt.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:41:45 comments: Hello Amarita,\n\nAppreciate your patience as we pursued your request.\n\nThis communication is concerning CS2920967 for order 953281228.\n\nWe have checked the information provided and wanted to let you know that the card was activated.\n\nIf the card is causing trouble for the customer, we can try voiding the card and attempt a refund.\n\nPlease let us know how to continue.\n\nWe await your reply.\n\nRegards,\nFidda A.\nCustomer Service Specialist.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:46:45 work_notes: Reviewed order\nverified card in Hawk.\nGave card status.\nOffered refund.\n3rd attempt.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:51:45 comments: Hello Amarita,\n\nAppreciate your patience as we pursued your request.\n\nThis communication is concerning CS2920967 for order 953281228.\n\nWe have checked the information provided and wanted to let you know that the card was activated.\n\nIf the card is causing trouble for the customer, we can try voiding the card and attempt a refund.\n\nPlease let us know how to continue.\n\nWe await your kind reply.\n\nRegards,\nFidda A.\nCustomer Service Specialist.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:56:45 work_notes: Reply Recieved From: xoxo.help@xoxoday.com\n\nHello, Good Day! Thank you for the reply. Member told us that the card now works correctly. Have a wonderful day! Best regards, Amarita.\n\nOn\nThur, 16 Sept at 4:10 PM\n<|ACTIVITY_START|>Creation date: 2023-08-19 16:01:45 work_notes: Reviewed order\nverified card in Hawk.\nGave card status.\nOffered refund.\nCP asked to close the case since CH said the card is okay now.\nTools used: CSM, Hawk, VR\n<|ACTIVITY_START|>Creation date: 2023-08-19 16:06:45 comments: Hello Amarita,\n\nAppreciate your patience as we pursued your request.\n\nThis communication is concerning CS2920967 for order 953281228.\n\nAppreciate the confirmation\n\nWe will close the case, please let us know if you have any more inquiries.\n\n\nRegards,\nFidda A.\nCustomer Service Specialist.\n<|ACTIVITY_START|>Creation date: 2023-08-19 16:11:45 comments: Reply Recieved From: xoxo.help@xoxoday.com\n<|ACTIVITY_START|>Creation date: 2023-08-19 16:16:45 comments: Automatic reply received.\nNo need for further assistance.\nClosing case.\nSLAs : \n\n<SLAS START>\nNo information available\n<SLAS END>",
        "inputs_pretokenized": "[]",
        "targets_pretokenized": "Issue:\nThe case is about an error code received by a customer while trying to use a card associated with Supplier Order # 953281228\/XOXO Order 12438779-1.\n\nKey Actions Taken:\n- Knowledge Article KB0130474 was added to the case.\n- The order was reviewed and the card was verified in Hawk.\n- The card status was given and a refund was offered.\n- The customer was contacted multiple times to confirm the status of the card and to offer a refund if necessary.\n- The customer's reply was received, confirming that the card is now working correctly.\n\nResolution:\nThe issue was resolved after the customer confirmed that the card is now working correctly. The case was closed thereafter."
    },
    {
        "ID": "Case: CS8762209",
        "case_details": "A case was opened with a short description of Generic Problem with Visa Rewards\nA longer description includes Customer did not obtain the $20 eGiftcard from AutoPay enrolling. Would like email of eGiftcard as soon as possible. Thanks, gr\nV tor Ofir\nVofir41@att.com\nCustomer Policy Number: CAAS722906421\n\nState: Closed\nAn array of activities from activity stream with created date, its type such as a comment or work note and if it's added by agent or customer and the text: \n<|ACTIVITY_START|>Creation date: 2023-08-19 15:11:44 work_notes: \nType of Issue: other\nContact Person: Giang Ravinder; giang.ravinder@ca.statefarm.com\nHow can we provide assistance for you today?: Customer did not obtain the $20 eGiftcard from AutoPay enrolling. Would like email of eGiftcard as soon as possible. Thanks, gr\nV tor Ofir\nEmail: vofir41@att.com\nCustomer Policy Number: CAAS722906421\nOther Issue: eGiftcard not received\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:16:44 comments: \nApologies, I do not see a record for this customer.\n\nHi Giang,\nApologies, I do not see a record for this customer.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:21:44 comments: Hi Shahriyar - no problem if there is no customer record. Can you please email him a $20 eGiftcard for the AutoPay campaign (37-95197is the Incentive Solutions promo code). Please let me know when the email is sent. Thank you, gr\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:26:44 comments: Hi Shahriyar - no problem if there is no customer record. Can you please email him a $20 eGiftcard for the AutoPay campaign (37-95197is the Incentive Solutions promo code). Please let me know when the email is sent. Thank you, gr\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:31:44 comments: You must enter in a new import file.\nHi Giang,\nYou must enter in a new import file.\nSLAs : \n\n<SLAS START>\nNo information available\n<SLAS END>",
        "inputs_pretokenized": "[]",
        "targets_pretokenized": "Issue:\nThe customer did not receive the $20 eGiftcard from AutoPay enrollment and requested for it to be emailed as soon as possible.\n\nKey Actions Taken:\n- Agent checked for customer's record but did not find any\n- Agent was requested to email a $20 eGiftcard for the AutoPay campaign using the Incentive Solutions promo code\n- Agent suggested to enter in a new import file\n\nResolution:\nNot enough case activity for AI to summarize yet"
    },
    {
        "ID": "Case: CS8779528",
        "case_details": "A case was opened with a short description of Card Re-issue Request - Question submitted via CS portal\n\n\nState: Closed\nAn array of activities from activity stream with created date, its type such as a comment or work note and if it's added by agent or customer and the text: \n<|ACTIVITY_START|>Creation date: 2023-08-19 15:11:45 comments: Type of Enquiry: Card Re-issue Request\nSubcategory: Visa Redeem\nProxy Number:\nOrder No: 6562650560\nCard Holder Name: Stanislau Kranz\nPurchase Date:\nAdditional Comments: VR ID 8549564877 - Customer did not receive. Please resend to:\n\n941 Macelgill Street, Forsander NC 27730\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:16:45 work_notes: Knoweldge Article KB7615372 Added.\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:21:45 comments: Hello Anat,\n\nAppreciate your email concerning CS7853751. We are glad to help.\n\nIn our system, the card was replaced and once created, will be delivered via USPS First Class Mail to the mentioned mailing address. Please wait 7 to 10 business days for the card to ship. We recommend waiting up to 15 additional business days to obtain the card, but usually, it comes sooner than that.\n\nThe card will be delivered, usually, in a plain white envelope. If the card does not arrive in this time period, please inform us.\n\nLast four digits of the new card: 5725\n\nWe appreciate your business, and are pleased to assist.\n\nRegards,\n\nSiarl R.\nClient Experience Specialist II\n<|ACTIVITY_START|>Creation date: 2023-08-19 15:26:45 work_notes: CS7853751 - Per AM request\n- The card has been replaced with the mentioned mailing address. Please wait 7-10 BD to be shipped (We recommend waiting up to 15 additional BD to obtain the card, usually, it comes sooner than that).\n- Non-received card. No fees applied.\nTools used - CSM\/TRS\/VR\nSLAs : \n\n<SLAS START>\nNo information available\n<SLAS END>",
        "inputs_pretokenized": "[]",
        "targets_pretokenized": "Issue:\nThe case is about a customer named Stanislau Kranz who did not receive his Visa Redeem card and requested for a re-issue to his address at 941 Macelgill Street, Forsander NC 27730.\n\nKey Actions Taken:\n- A knowledge article KB7615372 was added to the case.\n- The card was replaced and the customer was informed to wait for 7 to 10 business days for the card to be shipped.\n- The customer was advised to wait up to 15 additional business days to receive the card.\n- The last four digits of the new card were provided to the customer.\n\nResolution:\nThe card was replaced and is expected to be delivered to the customer's mentioned address within 7 to 10 business days, with a recommendation to wait up to 15 additional business days to receive the card."
    },
    {
        "ID": "Case: PAX4876567",
        "case_details": "A case was opened with a short description of Sent emails in the wrong Box\nA longer description includes Hello, \n\nWe recently moved one user to Google Workspace and this user has difficulties when they send emails from the common mailbox. When email is sent using common mailbox in the From field, then email is sent successfully, but it shows up in the wrong Sent folder - it shows in the user's primary email Sent folder, and not in the common mailbox folder. Please help to resolve this problem. \n\n\nMichele Kuran\nTechnology Manager\n\n[cid:message_347cd457a-adc3-6261- dd9201521debac.png]\n\n\nSeawest Division, 365 Brighton Road\nGrantchester Cambridge 35V AF8\nT: 0226 341 2657<tel:0226%341%2657>\nmichelekuran@turing.com|www.turing.com<https:\/\/link0.servicenow.com>\n\n\nThis message and data within it can possibly be confidential and under prtotection of the law. If you are not intended recipient you are not allowed to show or share this informatin with anyone or use it for any reason or store it on any device. If you are not intended recipient please contact Turing right awat by forwarding this message to mayl@turing.com and then immediately delte this email and all attachments. All liability by Turing resultyed from mishandling of this email is hereby excluded.\n\nScanned for visruses and spam by Sophos Inc.\n\nState: Awaiting Info\nAn array of activities from activity stream with created date, its type such as a comment or work note and if it's added by agent or customer and the text: \n<|ACTIVITY_START|>Creation date: 2022-11-19 06:24:51 comments: Hi Michele, My name is Brian and I hope to find you well. I will be your support engineer for this problem. I have investigated your request about sent emails being in the wrong Sent folder when sent from the common mailbox. I found are solution for your case. htttps:\/\/learn,google.com\/configure-common-mailbox-sent-folder-online Let me know if this does not help. Thank you for your business.\nSLAs : \n\n<SLAS START>\nNo information available\n<SLAS END>",
        "inputs_pretokenized": "[]",
        "targets_pretokenized": "Issue:\nA user who was recently moved to Google Workspace is experiencing difficulties with emails sent from the common mailbox. The emails are showing up in the user's primary email Sent folder instead of the common mailbox folder.\n\nKey Actions Taken:\n- The support engineer investigated the issue and found a potential solution.\n\nResolution:\nNot enough case activity for AI to summarize yet"
    }
]